namespace Maple.JinGu.Metadata
{
    /// <summary>
    /// ["Assembly-CSharp"."DBLoad"."ItemType2"]
    /// </summary>
    public enum ItemType2 : System.Int32
    {
        全部 = 0x00000000,
        资源 = 0x00000001,
        刀 = 0x00000002,
        剑 = 0x00000003,
        拳掌 = 0x00000004,
        枪棍 = 0x00000005,
        暗器 = 0x00000006,
        琴 = 0x00000007,
        衣服 = 0x00000008,
        鞋子 = 0x00000009,
        饰品 = 0x0000000A,
        武学 = 0x0000000B,
        丹方 = 0x0000000C,
        图纸 = 0x0000000D,
        战斗 = 0x0000000E,
        使用 = 0x0000000F,
        精力 = 0x00000010,
        恢复 = 0x00000011,
        读物 = 0x00000012,
        任务 = 0x00000013,
        饲育 = 0x00000014,
        炼丹 = 0x00000015,
        打造 = 0x00000016,
        工具 = 0x00000017,
        礼物 = 0x00000018
    }
}