namespace Maple.JinGu.Metadata
{
    /// <summary>
    /// ["Assembly-CSharp"."DBLoad"."NpcCamp"]
    /// </summary>
    public enum NpcCamp : System.Int32
    {
        牛家村 = 0x00000001,
        灵九宫 = 0x00000002,
        少林 = 0x00000003,
        青衫派 = 0x00000004,
        铸剑山庄 = 0x00000005,
        银武卫 = 0x00000006,
        铁尸门 = 0x00000007,
        七宝门 = 0x00000008,
        朝廷 = 0x00000009,
        雪山派 = 0x0000000A,
        豢龙会 = 0x0000000B,
        唐门 = 0x0000000C,
        剑庐 = 0x0000000D,
        松山剑派 = 0x0000000E,
        丐帮 = 0x0000000F,
        东海道心派 = 0x00000010,
        海鲨帮 = 0x00000012,
        万兽山庄 = 0x00000013,
        岭南四煞 = 0x00000014,
        红袖居 = 0x00000015,
        红莲苦海教 = 0x00000016,
        楞伽金刚宗 = 0x00000017,
        漕运帮 = 0x00000018,
        泾水城 = 0x00000019,
        合欢宗 = 0x0000001A,
        东林书阁 = 0x0000001B,
        方歆武馆 = 0x0000001C,
        大理城 = 0x0000001D,
        五毒教 = 0x0000001E,
        七煞山庄 = 0x0000001F,
        金武卫 = 0x00000020,
        百匪谷 = 0x00000021,
        漠北 = 0x00000022,
        神都城 = 0x00000023,
        大理王宫 = 0x00000024,
        静禅寺 = 0x00000025,
        八通商局 = 0x00000026,
        情缘 = 0x00000065,
        宠物 = 0x00000066,
        江湖 = 0x00000067
    }
}